{
  "nav": {
    "home": "Home",
    "about": "About Us",
    "gallery": "Gallery",
    "bibleGallery": "Bible Gallery",
    "donate": "Donate",
    "contact": "Contact Us",
    "signin": "Sign In",
    "signinWithGoogle": "Sign In with Google",
    "signup": "Sign Up",
    "signout": "Sign Out"
  },
  "home": {
    "title": "Beyond Media",
    "subtitle": "Explore Yang Yi's diverse artistic vision portfolio."
  },
  "about": {
    "title": "About Us",
    "subtitle": "Beyond Media is a company focused on innovative art and media experiences, committed to exploring the intersection of art and technology.",
    "founder": {
      "title": "Yang Yi, Founder and Artist",
      "description1": "Yang Yi is a visionary artist and the founder of Beyond Media, dedicated to pushing the boundaries of contemporary art and digital media.",
      "description2": "With over 15 years of multidisciplinary art experience, Yang's work explores the intersection of traditional art forms and cutting-edge technology.",
      "description3": "Born in China and educated internationally, Yang combines Eastern philosophical concepts with Western art techniques, bringing a unique cultural perspective to each creation."
    },
    "mission": {
      "title": "Our Mission",
      "description": "Our mission is to bring art to new heights through innovation and technology. We believe that art can inspire, educate, and change the world."
    },
    "vision": {
      "title": "Our Vision",
      "description": "Our vision is to become a leader in art and media innovation, creating memorable experiences for global audiences."
    }
  },
  "footer": {
    "explore": "Explore the boundaries of art and media",
    "quickLinks": "Quick Links",
    "legal": "Legal",
    "followUs": "Follow Us",
    "privacyPolicy": "Privacy Policy",
    "termsOfService": "Terms of Service",
    "cookiePolicy": "Cookie Policy",
    "copyright": "© {{year}} Beyond Media. All rights reserved.",
    "designDev": "Designed and developed by the Beyond Media team."
  },
  "yes": "Yes",
  "no": "No",
  "toast": {
    "signInSuccess": "Sign in successful!",
    "signInError": "Sign in failed. Please check your credentials.",
    "signUpSuccess": "Sign up successful! Welcome aboard!",
    "signUpError": "Sign up failed. Please try again later.",
    "signOutSuccess": "Sign out successful! See you next time!",
    "signOutError": "Sign out failed. Please try again later.",
    "donateSuccess": "Thank you for your generous donation! Your support helps us continue our mission.",
    "donateError": "Donation failed. Please check your payment details and try again.",
    "mustSignIn": "Please sign in to proceed."
  }
}
